backend/controllers/BankController.php

    public function actionIndex()
    {
        $searchModel = new BankSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $bankOwnerSearch = new BankOwnerSearch();
        $bankOwnerDataProvider = $bankOwnerSearch->search(Yii::$app->request->queryParams);
        $permissionName = Group::getAdministrator();
        $transferMoneySearch = new TransferMoneySearch();
        $transferMoneyDataProvider = $transferMoneySearch->search(Yii::$app->request->queryParams);
        $withdrawSearch = new WithdrawMoneySearch();
        $withdrawDataProvider = $withdrawSearch->search(Yii::$app->request->queryParams);
        $transactionSearch = new TransactionBankSearch();
        $transactionDataProvider = $transactionSearch->search(Yii::$app->request->queryParams);
        $walletSearch = new WalletUserSearch();
        $walletDataProvider = $walletSearch->search(Yii::$app->request->queryParams);
        $bankOwner = BankOwner::find()->all();
---
SELECT * FROM `lol_bank_owner`