backend/controllers/BillLotteryController.php

SELECT * FROM `lol_buy_lottery` WHERE `id` IN ('3', '4', '5')
---
    public function actionView($id)
    {
        $model = $this->findModel($id);
        $idBuyLotterys = explode(',', $model->idBuyLottery);
        $query = BuyLottery::find()->where(['id' => $idBuyLotterys]);
        $dataProvider = new ActiveDataProvider([
            'query' => $query,
        ]);
        $totalMoneyPlay = 0;
        $totalMoneyPay = 0;
        $buyLotterys = $query->asArray()->all();

SELECT * FROM `lol_bill_lottery` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = BillLottery::findOne($id)) !== null) {