backend/controllers/ConditionLotteryController.php

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $lotterys = Lottery::find()->all();
        $listData = ArrayHelper::map($lotterys, 'id', 'name');
        $typeLotterys = TypeLottery::find()->where(['status' => '1'])->all();
---
SELECT * FROM `lol_type_lottery` WHERE `status`='1'

    protected function findModel($id)
    {
        if (($model = ConditionLottery::findOne($id)) !== null) {
---
SELECT * FROM `lol_condition_lottery` WHERE `id`='1'