backend/controllers/GroupController.php

    protected function findModel($id)
    {
        if (($model = Group::findOne($id)) !== null) {
---
SELECT * FROM `lol_group` WHERE `id`='4'