backend/controllers/IssueController.php

    public function actionView($id)
    {
        $this->layout = 'issue-answer';
        $answerIssue = new AnswerIssue();
        $answerDescription = AnswerIssue::findAll(['issueId' => $id]);
---
SELECT * FROM `lol_answer_issue` WHERE `issueId`='1'

    protected function findModel($id)
    {
        if (($model = Issue::findOne($id)) !== null) {
---
SELECT * FROM `lol_issue` WHERE `id`='1'