backend/controllers/LeagueFootballController.php

SELECT * FROM `lol_leaguefootball`
SELECT * FROM `lol_teamfootball`
---
    public function actionIndex()
    {
        $searchModel = new LeaguefootballSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $manageMatchSearchModel = new MatchFootballSearch();
        $manageMatchDataProvider = $manageMatchSearchModel->search(Yii::$app->request->queryParams);
        $teamFootballSearchModel = new TeamFootballSearch();
        $teamFootballDataProvider = $teamFootballSearchModel->search(Yii::$app->request->queryParams);
        $buyFootballSearchModel = new BuyFootballSearch();
        $buyFootballDataProvider = $buyFootballSearchModel->search(Yii::$app->request->queryParams);
        $billFootballSearchModel = new BillFootballSearch();
        $billFootballDataProvider = $billFootballSearchModel->search(Yii::$app->request->queryParams);
        $leagueFootball = Leaguefootball::find()->all();
        $listLeagueFootball = ArrayHelper::map($leagueFootball, 'id','name');
        $teamFootball = TeamFootball::find()->all();