backend/controllers/LotteryPeriodController.php

SELECT * FROM `lol_type_lottery`
SELECT * FROM `lol_promotion_lottery`
---
    public function actionIndex()
    {
        $searchModel = new LotterySearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $promotionLotterySearchModel = new PromotionLotterySearch();
        $promotionLotteryDataProvider = $promotionLotterySearchModel->search(Yii::$app->request->queryParams);
        $typeLotterySearchModel = new TypeLotterySearch();
        $typeLotteryDataProvider = $typeLotterySearchModel->search(Yii::$app->request->queryParams);
        $paymentLotterySearchModel = new PaymentLotterySearch();
        $paymentLotteryDataProvider = $paymentLotterySearchModel->search(Yii::$app->request->queryParams);
        $conditionLotterySearchModel = new ConditionLotterySearch();
        $conditionLotteryDataProvider = $conditionLotterySearchModel->search(Yii::$app->request->queryParams);
        $buyLotterySearchModel = new BuyLotterySearch();
        $buyLotteryDataProvider = $buyLotterySearchModel->search(Yii::$app->request->queryParams);
        $winLotterySearchModel = new WinLotterySearch();
        $winLotteryDataProvider = $winLotterySearchModel->search(Yii::$app->request->queryParams);
        $typeLottery = TypeLottery::find()->all();
        $listTypeLottery = ArrayHelper::map($typeLottery, 'id', 'name');
        $promotionLottery = PromotionLottery::find()->all();