backend/controllers/MatchFootballController.php

    public function actionCreate()
    {
        $model = new MatchFootball();
        $league = Leaguefootball::find()->all();
        $listDataLeague = ArrayHelper::map($league, 'id', 'name');
        $team = TeamFootball::find()->all();
---
SELECT EXISTS(SELECT * FROM `lol_leaguefootball` WHERE `lol_leaguefootball`.`id`='5')
SELECT * FROM `lol_leaguefootball`
SELECT * FROM `lol_teamfootball`