backend/controllers/ReportLotteryController.php

SELECT * FROM `lol_buy_lottery` WHERE `lotteryId`=50
---
    public function actionNumber($lotteryId = null)
    {
        $lotterys = Lottery::find()->where(['status' => 1])->all();
        $listDataLottery = ArrayHelper::map($lotterys, 'id', 'name');
        $buyLotterys = [];
        if ($lotteryId) {
            $buyLotterys = BuyLottery::find()->where(['lotteryId' => $lotteryId])->all();
        } else {
            $lottery = Lottery::find()->where(['status' => 1])->orderBy('id DESC')->limit(1)->one();
            if ($lottery) {
                $buyLotterys = BuyLottery::find()->where(['lotteryId' => $lottery->id])->all();