backend/controllers/SiteController.php

        $lottery = Lottery::find()->orderBy('id DESC')->limit(1)->one();
        $lotterys = Lottery::find()->where(['status' => 1])->all();
        $listLottery = ArrayHelper::map($lotterys,'id','name');
        $groupNormal = Group::find()->where(['name' => 'ผู้ใช้ทั่วไป'])->one();
        $groupAgenet = Group::find()->where(['name' => 'ตัวแทนขาย'])->one();
---
SELECT * FROM `lol_group` WHERE `name`='ผู้ใช้ทั่วไป'
SELECT * FROM `lol_group` WHERE `name`='ตัวแทนขาย'

        $countUserAgentWeek = 0;
        $totalMoneyPay = 0;
        if($lottery) {
            $countNewOrder = OrderLottery::find()->where(['orderLotteryId' => $lottery->id])->count();
            $countUserNormalWeek = UserGroup::find()->joinWith('user')->where(
                'yearweek(DATE(' . User::tableName() . '.createdAt), 1) = yearweek(curdate(), 1)')
                ->andWhere([User::tableName() . '.status' => 10, 'groupId' => $groupNormal->id])->count();
            $countUserAgentWeek = UserGroup::find()->joinWith('user')->where(
                'yearweek(DATE(' . User::tableName() . '.createdAt), 1) = yearweek(curdate(), 1)')
                ->andWhere([User::tableName() . '.status' => 10, 'groupId' => $groupAgenet->id])->count();
            $buyPreviousMonths = BuyLottery::find()->where('MONTH(createdAt) = MONTH(CURRENT_DATE - INTERVAL 1 MONTH)')->all();
---
SELECT COUNT(*) FROM `lol_order_lottery` WHERE `orderLotteryId`=54
SELECT COUNT(*) FROM `lol_user_group` LEFT JOIN `lol_user` ON `lol_user_group`.`userId` = `lol_user`.`id` WHERE (yearweek(DATE(`lol_user`.createdAt), 1) = yearweek(curdate(), 1)) AND ((`lol_user`.`status`=10) AND (`groupId`=5))
SELECT COUNT(*) FROM `lol_user_group` LEFT JOIN `lol_user` ON `lol_user_group`.`userId` = `lol_user`.`id` WHERE (yearweek(DATE(`lol_user`.createdAt), 1) = yearweek(curdate(), 1)) AND ((`lol_user`.`status`=10) AND (`groupId`=4))
SELECT * FROM `lol_buy_lottery` WHERE MONTH(createdAt) = MONTH(CURRENT_DATE - INTERVAL 1 MONTH)

    public function actionDashboard2($date = null, $endDate = null, $type = 'etc')
    {
        $countIssue = Issue::find()->count();
        $sumWithDrawMoney = WithdrawMoney::find()->select('SUM(money) as money')->where(['status' => 1])->one();
        $sumTransferMoney = TransferMoney::find()->select('SUM(money) as money')->where(['status' => 1])->one();
---
SELECT COUNT(*) FROM `lol_issue`
SELECT SUM(money) as money FROM `lol_withdraw_money` WHERE `status`=1
SELECT SUM(money) as money FROM `lol_transfer_money` WHERE `status`=1

			$startDate = $borders['startDate']->setTime(0, 0, 0)->format($format);
			$endDate = $borders['endDate']->setTime(23, 59, 59)->format($format);
		}
        $userGroups = UserGroup::find()->joinWith('group')->where(['name' => 'ผู้ใช้ทั่วไป'])->orWhere(['name' => 'ตัวแทนขาย'])->all();
---
SELECT `lol_user_group`.* FROM `lol_user_group` LEFT JOIN `lol_group` ON `lol_user_group`.`groupId` = `lol_group`.`id` WHERE (`name`='ผู้ใช้ทั่วไป') OR (`name`='ตัวแทนขาย')

                }
            }
        }
        $totalVisitor = Visitor::find()->count();
---
SELECT COUNT(*) FROM `lol_visitor`

    public function actionLogin()
    {
        if (!Yii::$app->user->isGuest) {
            return $this->goHome();
        }
        $this->layout = 'main-login.php';
        $model = new LoginForm();
        $model->setScenario('backendLogin');
        if ($model->load(Yii::$app->request->post()) && $model->login()) {
            $userLog = new UserLog();
            $userLog->userId = Yii::$app->user->id;
            $userLog->ipAddress = getHostByName(getHostName());
            $userLog->status = 1;
            if (!$userLog->save()) {
---
INSERT INTO `lol_user_log` (`userId`, `ipAddress`, `status`) VALUES (1, '192.168.1.142', 1)

    public function actionLogout()
    {
        $userLog = new UserLog();
        $userLog->userId = Yii::$app->user->id;
        $userLog->ipAddress = getHostByName(getHostName());
        $userLog->status = 2;
        if (!$userLog->save()) {
---
INSERT INTO `lol_user_log` (`userId`, `ipAddress`, `status`) VALUES (1, '192.168.1.142', 2)