backend/controllers/TransferMoneyController.php

SELECT * FROM `lol_group` WHERE `name`='Administrator'
---
    public function actionIndex()
    {
        $group = Group::find()->where(['name' => self::GROUP_NAME_ADMINISTRATOR])->one();

SELECT * FROM `lol_note_transfer_money` WHERE `idTransferMoney`=2
---
    public function actionView($id)
    {
        $model = $this->findModel($id);
        $noteTransferMoney = NoteTransferMoney::findOne(['idTransferMoney' => $model->id]);

SELECT * FROM `lol_transfer_money` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = TransferMoney::findOne($id)) !== null) {