backend/controllers/TypeLotteryController.php

    public function actionCreate()
    {
        $models = [new TypeLottery()];

        $request = Yii::$app->request;

        if ($request->isPost) {
            $models = Model::createMultiple(TypeLottery::className());
---
INSERT INTO `lol_type_lottery` (`name`, `status`) VALUES ('2 ตัวบน + ล่าง', 1)