backend/controllers/UserController.php

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $bank = Bank::find()->all();
---
SELECT * FROM `lol_bank`
SELECT EXISTS(SELECT * FROM `lol_bank` WHERE `lol_bank`.`id`='1')

    protected function findModel($id)
    {
        if (($model = User::findOne($id)) !== null) {
---
SELECT * FROM `lol_user` WHERE `id`='8'