backend/views/payment-lottery/index.php

SELECT * FROM `lol_promotion_lottery`
---
            [
                'attribute' => 'promotionLotteryId',
                'value' => 'promotionLottery.name',
                'filter' => ArrayHelper::map(PromotionLottery::find()->asArray()->all(), 'id', 'name')