frontend/controllers/IssueController.php

SELECT * FROM `lol_user_group` WHERE `userId`=2
INSERT INTO `lol_issue` (`name`, `description`, `createdBy`, `createdAt`, `updatedAt`) VALUES ('ไม่ปรับยอดฝาก', '<p>erere</p>\r\n\r\n<p><img alt=\"\" src=\"/lottery/vendor/sunhater/kcfinder/upload/files/4%20Reasons.jpg\" style=\"height:500px;width:560px;\" /><img alt=\"\" src=\"/lottery/vendor/sunhater/kcfinder/upload/files/Screenshot%20(24).png\" style=\"height:768px;\" /></p>\r\n', 2, NOW(), NOW())
---
    public function actionCreate()
    {
        $model = new Issue();
        $user = $this->findUser(Yii::$app->user->id);
        $userGroup = UserGroup::find()->where(['userId' => $user->id])->one();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

INSERT INTO `lol_answer_issue` (`issueId`, `description`, `createdBy`, `createdAt`, `updatedAt`) VALUES (1, '<p>gghg</p>\r\n\r\n<p><img alt=\"\" src=\"/lottery/vendor/sunhater/kcfinder/upload/files/picture0001.jpeg\" style=\"height:332px; width:500px\" /></p>\r\n', 2, NOW(), NOW())
SELECT * FROM `lol_answer_issue` WHERE `issueId`='1'
---
    public function actionView($id)
    {
        $answerIssue = new AnswerIssue();
        $answerDescription = AnswerIssue::findAll(['issueId' => $id]);
        $request = Yii::$app->request;
        if ($request->isPost) {
            $answerIssue->issueId = $id;
            if ($answerIssue->load($request->post()) && $answerIssue->save()) {

SELECT * FROM `lol_user` WHERE `id`=2
---
    protected function findUser($id)
    {
        if (($model = User::findOne($id)) !== null) {

SELECT * FROM `lol_issue` WHERE (`id`='1') AND (`createdBy`=2)
---
    protected function findModel($id)
    {
        if (($model = Issue::findOne([
                    'id' => $id,
                    'createdBy' => Yii::$app->user->id]
            )) !== null) {