frontend/controllers/LotteryController.php

    public function actionPromotion($id)
    {
        $lotteryId = $id;
        $lottery = $this->checkDateTimeLottery($id);
        $userGroup = UserGroup::find()->where(['userId' => Yii::$app->user->id])->one();
        $promotions = PromotionLottery::find()->asArray()->all();
        $typeLotterys = TypeLottery::find()->asArray()->all();
---
SELECT * FROM `lol_user_group` WHERE `userId`=10
SELECT * FROM `lol_promotion_lottery`
SELECT * FROM `lol_type_lottery`

    public function actionOrder($id, $promotionId)
    {
        $lottery = $this->checkDateTimeLottery($id);
        $request = Yii::$app->request;
        $model = new OrderLottery();
        $model->setScenario('order');
        $searchModel = new OrderLotterySearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams, $id);
        $typeLottery = PaymentLottery::find()->joinWith('typeLottery')->select([
            'typeLotteryId',
            PaymentLottery::tableName().'.promotionLotteryId',
            TypeLottery::tableName() . '.id',
            TypeLottery::tableName() . '.name'])->where([
            'lotteryId' => $id,
            'promotionLotteryId' => $promotionId,
            'status' => 1])->groupBy('id')->asArray()->all();
        $listData = ArrayHelper::map($typeLottery, 'id', 'name');
        $promotion = PromotionLottery::findOne(['id' => $promotionId]);
        $userGroup = UserGroup::find()->where(['userId' => Yii::$app->user->id])->one();
        if ($promotion->name === $promotion::PROMOTION_SALE && $userGroup->group->name !== User::GROUP_NAME_SALE) {
            throw new ForbiddenHttpException(Yii::t('app', 'You not have buy promotion'));
        }
        if ($request->isPost) {
            $model->load($request->post());
            $paymentLottery = PaymentLottery::find()->where(['lotteryId' => $id,
                'promotionLotteryId' => $promotionId,
                'typeLotteryId' => $model->typeLotteryId
            ])->one();
---
SELECT `typeLotteryId`, `lol_payment_lottery`.`promotionLotteryId`, `lol_type_lottery`.`id`, `lol_type_lottery`.`name` FROM `lol_payment_lottery` LEFT JOIN `lol_type_lottery` ON `lol_payment_lottery`.`typeLotteryId` = `lol_type_lottery`.`id` WHERE (`lotteryId`='51') AND (`promotionLotteryId`='1') AND (`status`=1) GROUP BY `id`
SELECT * FROM `lol_promotion_lottery` WHERE `id`='1'
SELECT * FROM `lol_user_group` WHERE `userId`=10
SELECT EXISTS(SELECT * FROM `lol_user` WHERE `lol_user`.`id`=10)
SELECT EXISTS(SELECT * FROM `lol_payment_lottery` WHERE `lol_payment_lottery`.`id`=652)
SELECT EXISTS(SELECT * FROM `lol_type_lottery` WHERE `lol_type_lottery`.`id`='5')
SELECT * FROM `lol_payment_lottery` WHERE (`lotteryId`='51') AND (`promotionLotteryId`='1') AND (`typeLotteryId`='5')

    public function actionBuy($id)
    {
        $lottery = $this->checkDateTimeLottery($id);
        $orders = OrderLottery::find()->where(['userId' => Yii::$app->user->id, 'OrderlotteryId' => $id, 'isExistBuy' => 0])->all();
---
SELECT EXISTS(SELECT * FROM `lol_user` WHERE `lol_user`.`id`=1)