frontend/controllers/SiteController.php

    public function actionIndex()
    {
        $information = Information::findOne(['id' => 6]);
        $query = <<<EOT
SELECT * FROM `lol_lottery_period` WHERE `startDateTime` <= NOW() AND NOW() <= `endDateTime` AND status = 1 ORDER BY startDateTime ASC LIMIT 1
EOT;
        $lottery = Yii::$app->db->createCommand($query)->queryOne();
        $condtionLottery = ConditionLottery::findAll(['lotteryId' => $lottery['id']]);
        $lastLottery = WinLottery::find()->select('lotteryId')->orderBy('id DESC')->one();
        if ($lastLottery) {
            $winLotterys = WinLottery::find()->joinWith('typeLottery')->where([
                'lotteryId' => $lastLottery->lotteryId
            ])->andWhere(['NOT LIKE', TypeLottery::tableName() . '.name', 'โต๊ด'])->all();
        }
        $feedNews = FeedNews::find()->all();
---
SELECT * FROM `lol_information` WHERE `id`=6
SELECT * FROM `lol_condition_lottery` WHERE `lotteryId`='51'
SELECT `lotteryId` FROM `lol_win_lottery` ORDER BY `id` DESC
SELECT `lol_win_lottery`.* FROM `lol_win_lottery` LEFT JOIN `lol_type_lottery` ON `lol_win_lottery`.`typeLotteryId` = `lol_type_lottery`.`id` WHERE (`lotteryId`=20) AND (`lol_type_lottery`.`name` NOT LIKE '%โต๊ด%')
SELECT * FROM `lol_feed_news`