frontend/controllers/UserController.php

SELECT * FROM `lol_wallet_user` WHERE `userId`=10
SELECT * FROM `lol_user_group` WHERE `userId`=10
SELECT * FROM `lol_user_log` WHERE `userId`='10' ORDER BY `createdAt` LIMIT 10
SELECT COUNT(*) FROM `lol_buy_lottery` WHERE `isTrue`=0
---
    public function actionProfile($id)
    {
        if (Yii::$app->user->id != $id) {
            throw new ForbiddenHttpException(Yii::t('app', 'You not have permission'));
        }
        $model = $this->findUser($id);
        $total = $model->findWallet($id);
        $wallet = WalletUser::find()->where(['userId' => Yii::$app->user->id])->one();
        $userGroup = UserGroup::find()->where(['userId' => $model->id])->one();
        $userLogs = UserLog::find()->where(['userId' => $id])->limit(10)->asArray()->orderBy(['createdAt' => SORT_ASC])->all();
        $buyLottery = BuyLottery::find()->where(['isTrue' => 0])->count();

SELECT * FROM `lol_user` WHERE `id`='10'
---
    protected function findUser($id)
    {
        if (($model = User::findOne($id)) !== null) {