backend/views/user/index.php

                'options' => ['width' => '80px'],
            ],
            'email:email',
            [
                'attribute' => 'groupId',
                'label' => Yii::t('app', 'Group Name'),
                'format' => 'html',
                'filter' => \yii\helpers\ArrayHelper::map(\backend\models\Group::find()->all(), 'id', 'name'),
                'value' => function ($model) {
                    $groups = UserGroup::find()->select(['name', 'groupId'])->joinWith(['groupName'])->where(['userId' => $model->id])->asArray()->all();
                    $groupName = '';
                    if ($groups) {
                        foreach ($groups as $key => $group) {
                            $groupName .= '<p>' . $group['name'] . '</p>';
                        }
                    } else {
                        $groupName = 'ไม่มีกลุ่ม';
                    }
                    return $groupName;
                }
            ],
---
SELECT `name`, `groupId` FROM `lol_user_group` LEFT JOIN `lol_group` ON `lol_user_group`.`groupId` = `lol_group`.`id` WHERE `userId`=7
SELECT * FROM `lol_group`
SELECT `name`, `groupId` FROM `lol_user_group` LEFT JOIN `lol_group` ON `lol_user_group`.`groupId` = `lol_group`.`id` WHERE `userId`=10