frontend/views/lottery/promotion.php

                        <?php foreach ($promotions as $key => $promotion) {
                            $command = Yii::$app->db->createCommand("SELECT sum(discount) FROM " . PaymentLottery::tableName() . "WHERE promotionLotteryId =" . $promotion['id'] . " and lotteryId =" . $lotteryId);
                            $sum = $command->queryScalar();
                            $query = PaymentLottery::find()->where([
                                'lotteryId' => $lotteryId,
                                'promotionLotteryId' => $promotion['id']
                            ]);
---
SELECT sum(discount) FROM `lol_payment_lottery`WHERE promotionLotteryId =1 and lotteryId =51

                                        </div>
                                        <div class="hidden-sm hidden-xs" id="price-detail-r1">
                                            <?php foreach ($typeLotterys as $typeLottery) {
                                                $paymentLottery = PaymentLottery::find()->where([
                                                    'promotionLotteryId' => $promotion['id'],
                                                    'typeLotteryId' => $typeLottery['id'],
                                                    'lotteryId' => $lotteryId
                                                ])->one();
---
SELECT * FROM `lol_payment_lottery` WHERE (`promotionLotteryId`='1') AND (`typeLotteryId`='1') AND (`lotteryId`='51')