frontend/views/bill-lottery/list.php

SELECT * FROM `lol_buy_lottery` WHERE `id`='18'
---
                    'attribute' => 'name',
                    'value' => 'name'
                ],
                [
                    'label' => 'Lottery Name',
                    'attribute' => 'idLottery',
                    'filter' => ArrayHelper::map(\backend\models\Lottery::find()->all(),'id','name'),
                    'value' => function ($model) {
                        $lotteryId = $model->buyLottery['lotteryId'];
                        if (Yii::$app->request->get('BillLotterySearch')['idLottery']) {
                            $lotteryId = Yii::$app->request->get('BillLotterySearch')['idLottery'];
                            $lottery = \backend\models\Lottery::findOne(['id' => $lotteryId]);
                            return $lottery->name;
                        } else {
                            $lottery = \backend\models\Lottery::findOne(['id' => $lotteryId]);
                            return $lottery->name;
                        }
                    },
                ],

SELECT * FROM `lol_buy_lottery` WHERE (`id` IN ('11', '12', '13')) AND (`isTrue`=1)
---
                    'contentOptions' => ['class' => 'text-center'],
                    'value' => function ($model) {
                        $idLotteried = explode(',', $model->idBuyLottery);
                        $buyLotteried = BuyLottery::find()->where(['id' => $idLotteried, 'isTrue' => 1])->all();

SELECT `isTrue` FROM `lol_buy_lottery` WHERE `id` IN ('11', '12', '13') GROUP BY `isTrue`
---
                    'format' => 'html',
                    'value' => function ($model) {
                        $idLotteried = explode(',', $model->idBuyLottery);
                        $buyLotteried = BuyLottery::find()->select('isTrue')->where(['id' => $idLotteried])->groupBy('isTrue')->all();

SELECT * FROM `lol_buy_lottery` WHERE `id` IN ('11', '12', '13')
SELECT COUNT(*) FROM `lol_buy_lottery` WHERE (`id` IN ('11', '12', '13')) AND (`isTrue` <> 0)
---
                        'delete-chit' => function ($model) {
                            $idBuyLottery = $model->idBuyLottery;
                            $idBuyLotteried = explode(',', $idBuyLottery);
                            $buyLottery = \backend\models\BuyLottery::find()->where(['id' => $idBuyLotteried])->one();
                            $isAnswer = BuyLottery::find()->select('id')->where(['id' => $idBuyLotteried])->andWhere(['<>', 'isTrue', 0])->count();