backend/layout/yii2-app/layouts/header.php

                    </ul>
                </li>
                <?php
                $transferMoneys = TransferMoney::find()->where(['status' => 0])->asArray()->all();
                $withDrawMoney = WithdrawMoney::find()->where(['status' => 0])->asArray()->all();
                $users = User::find()->where(['status' => User::STATUS_PADDING])->asArray()->all();
---
SELECT * FROM `lol_transfer_money` WHERE `status`=0
SELECT * FROM `lol_withdraw_money` WHERE `status`=0
SELECT * FROM `lol_user` WHERE `status`=20

                    </ul>
                </li>
                <?php
                $winLotteried = WinLottery::find()->where(['answer' => 0])->all();
---
SELECT * FROM `lol_win_lottery` WHERE `answer`=0

                <?php
                $countIssue = 0;
                $issuesIds = [];
                $issues = Issue::find()->all();
                foreach ($issues as $issue) {
                    $issuesId = $issue->id;
                    $answerIssue = AnswerIssue::find()->select('id')->where(['issueId' => $issuesId])->count();
---
SELECT * FROM `lol_issue`
SELECT COUNT(*) FROM `lol_answer_issue` WHERE `issueId`=1