common/models/LoginForm.php

    public function login()
    {
        if ($this->validate()) {
            $userGroup = $this->getUser()->userGroup;
            $groupNameByUser = count($userGroup) ? $userGroup[0]->group->name : [];
---
SELECT * FROM `lol_user_group` WHERE `userId`=1
SELECT * FROM `lol_group` WHERE `id`=3