common/models/User.php

SELECT * FROM `lol_user` WHERE (`id`=10) AND (`status`=10)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `lol_user` WHERE (`username`='sys') AND (`status`=10)
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `lol_wallet_user` WHERE `userId`=10
---
    public static function findWallet($id)
    {
        $wallet = WalletUser::findOne(['userId' => $id]);