frontend/views/layouts/main.php

SELECT * FROM `lol_withdraw_money` WHERE (YEARWEEK(createdAt) = YEARWEEK(CURRENT_DATE) and status = 1) AND (`createdBy`=10)
SELECT * FROM `lol_transfer_money` WHERE (YEARWEEK(createdAt) = YEARWEEK(CURRENT_DATE) and status = 1) AND (`userId`=10)
SELECT `lol_answer_issue`.`id`, `lol_answer_issue`.`description`, `lol_answer_issue`.`issueId`, `lol_answer_issue`.`createdBy`, `lol_answer_issue`.`createdAt`, `lol_issue`.`id`, `lol_issue`.`createdBy` FROM `lol_answer_issue` LEFT JOIN `lol_issue` ON `lol_answer_issue`.`issueId` = `lol_issue`.`id` WHERE (`lol_issue`.`createdBy`=10) AND (`lol_answer_issue`.createdAt IN ( SELECT max(`lol_answer_issue`.createdAt) AS createdAt FROM `lol_answer_issue` GROUP BY issueId)) GROUP BY `issueId` HAVING `lol_answer_issue`.`createdBy` <> 10 ORDER BY `createdAt` DESC
---
                            </a>
                        </li>
                        <?php
                        $withDrawMoneys = WithdrawMoney::find()->where('YEARWEEK(createdAt) = YEARWEEK(CURRENT_DATE) and status = 1')->andWhere(['createdBy' => Yii::$app->user->id])->all();
                        $transferMoneys = TransferMoney::find()->where('YEARWEEK(createdAt) = YEARWEEK(CURRENT_DATE) and status = 1')->andWhere(['userId' => Yii::$app->user->id])->all();
                        $answerIssues = AnswerIssue::find()->select([
                            AnswerIssue::tableName(). '.id',
                            AnswerIssue::tableName(). '.description',
                            AnswerIssue::tableName(). '.issueId',
                            AnswerIssue::tableName(). '.createdBy',
                            AnswerIssue::tableName(). '.createdAt',
                            Issue::tableName(). '.id',
                            Issue::tableName(). '.createdBy',
                        ])->joinWith('issue')->where([
                            Issue::tableName(). '.createdBy' => Yii::$app->user->id,
                        ])->andWhere(AnswerIssue::tableName(). '.createdAt IN ( SELECT max(`lol_answer_issue`.createdAt) AS createdAt FROM '. AnswerIssue::tableName().' GROUP BY issueId)')
                        ->orderBy('createdAt DESC')->having([
                            '<>' , AnswerIssue::tableName(). '.createdBy', Yii::$app->user->id
                        ])->groupBy('issueId')->all();

SELECT * FROM `lol_menu` WHERE (`parentId` IS NULL) AND (`status`=TRUE)
---
                        <a href="<?= Url::to(['site/index']) ?>">หน้าแรก</a>
                    </li>
                    <?php
                    $menus = Menu::find()->where(['parentId' => null, 'status' => true])->all();

SELECT * FROM `lol_menu` WHERE `parentId`=4
---
                                </a>
                                <ul class="dropdown-menu pull-left">
                                    <?php
                                    $parentMenus = Menu::find()->where(['parentId' => $menu['id']])->all();