backend/views/match-football/index.php

SELECT COUNT(*) FROM `lol_result_football` WHERE `matchId`=1
---
            'scoreTeam2',
            'startMatch',
            'endMatch',
            [
                'label' => Yii::t('app', 'Status'),
                'value' => function ($model) {
                    $isAnswer = ResultFootball::find()->where(['matchId' => $model->id])->count();
                    return $isAnswer ? Yii::t('app', 'Answer') : Yii::t('app', 'Not Answer');
                }
            ],