backend/models/Group.php

SELECT * FROM `lol_group` WHERE `name`='Administrator'
---
    public static function getAdministrator()
    {
        $group = Group::find()->where(['name' => User::GROUP_NAME_ADMINISTRATOR])->one();