backend/models/OrderLottery.php

    public function validateMoneyWallet()
    {
        $money = OrderLottery::find()->select(['SUM(moneyPay) as moneyPay'])->where(['userId' => Yii::$app->user->id, 'OrderlotteryId' => $this->orderlottery, 'isExistBuy' => 0])->one();
---
SELECT SUM(moneyPay) as moneyPay FROM `lol_order_lottery` WHERE (`userId`=10) AND (`OrderlotteryId` IN (51, 'หวยรัฐบาลประจำงวดวันที่ 1 กันยายน 2565', '2022-08-17 12:00:44', '2022-09-01 12:00:44', 1, '2022-08-20 20:17:39', '2022-08-20 20:17:39')) AND (`isExistBuy`=0)

    public function validateNumberByConditionLottery()
    {
        $conditionLottery = ConditionLottery::find()->where(['lotteryId' => $this->OrderlotteryId, 'number' => $this->number, 'typeLotteryId' => $this->typeLotteryId])->one();
---
SELECT * FROM `lol_condition_lottery` WHERE (`lotteryId`='51') AND (`number`='01') AND (`typeLotteryId`='5')

    public function validateFixNumberByTypeLottery()
    {
        $typeLottery = TypeLottery::findOne(['id' => $this->typeLotteryId]);
---
SELECT * FROM `lol_type_lottery` WHERE `id`='5'