frontend/views/user/left-profile.php

                <p class="font-blue-dark text-decoration-none"><?= Yii::$app->user->identity->fullName ?> </p>
            </div>
            <div class="profile-usertitle-job">
                <span class="font-position-normal-user"><?= $userGroup->group->name ?></span>
---
SELECT * FROM `lol_group` WHERE `id`=5