frontend/views/site/index.php

SELECT * FROM `lol_comment_feed_news` WHERE `feedNewsId`=1
---
                                                      title="<?= $feedNew->createdAt ?>"><i class="fa fa-clock-o"></i><?= $feedNew->createdAt ?>
                                            </span>
                                                <span class="mt-comment-date margin-right-10">
                                                <?php $commentFeedNewsObjs = CommentFeedNews::findAll(['feedNewsId' => $feedNew->id]); ?>

SELECT COUNT(*) FROM `lol_order_lottery` WHERE (`orderLotteryId`=51) AND (`number`='01')
---
                                    <tbody>
                                    <?php foreach ($conditionLottery as $condition) { ?>
                                        <tr>
                                            <?php $orderLottery = \backend\models\OrderLottery::find()->where([
                                                'orderLotteryId' => $condition->lotteryId,
                                                'number' => $condition->number])->count() ?>